// 装备参数信息表
// 属性值 可以为负数 (比较黑的装备 属性)

/* 
 物攻装备: 应该加更多的 力量 , 物防 , 敏捷:(主:物防,闪避)
魔法装备 应该加更多的智力 和 运气  ,并且面板伤害要低一点

*/

//注意 s === undefind 时, s 标记为2,男女通用  0:男,1:女
// [1,6500,1500,2500] 
var userZbCfg={
     // 0:气血值,1:魔法值,2:力量值,3:智力值,4:敏捷,5:运气,6:物防,7:魔防,8:暴击,9:闪避,10:伤害 
     //0:武器,1:头,2:上身,3:裤或裙,4:鞋子,5:披风,6:饰品或护符0 , 7:饰品或护符1  ( 其中对应上面的0-9属性 )
     //{0:'气血',1:'魔法',2:'力量',3:'智力',4:'敏捷',5:'运气'}
    /*  map:{//id 对应装备类型
       1:0,     //武器 
       6500:1,  //头发
       1500:2,  //上身
       2500:3,  //裤-裙
     }, */
     0:{//武器  8450(背包图标大 id)
        1:{//装备id 
            n:0, //背包对应图标 id,n 
            p:'利刃之刺',// 武器命名和描述,
            z:0, //0:单手剑,1:单手斧,2:单手锤,3:双手剑,4:双手斧,5:双手锤 ,6:单手法杖,7:双手法杖  (用以区分不同武器攻击系数)(没有矛刺之类的)
            a:{
                0:[200,60], //0:基本值, 1:随机增加值 (基本加随机,获取时固定)
                1:[200,60], 2:[30,10],3:[-10,20], 4:[30,10],5:[-10,20],8:[10,10],10:[200,50]
            }
        },
     },
     1:{//头发 / 帽子  8451
        6500:{
           n:0,
           p:'初音-发型',
           s:1, //1:女  性别
           a:{
               0:[200,60],1:[200,60],2:[20,10],3:[20,10],4:[20,10],5:[0,5],6:[100,50],7:[100,50],8:[0,5]
           }, 
        },
     },
     2:{// 上身 8452
         1500:{
            n:0,
            p:'初音-上衣',
            s:1, //1:女
            a:{
                0:[150,60],1:[200,60],2:[20,10],3:[20,10],4:[20,10],5:[0,5],6:[100,50],7:[100,50],8:[0,5]
            }, 
         }, 
     },
     3:{// 裤/裙 8453
         2500:{
            n:0,
            p:'初音-裙',
            s:2, //2:通用
            a:{
                0:[150,60],1:[150,60],2:[15,10],3:[15,10],4:[15,10],5:[0,5],6:[70,50],7:[70,50],8:[0,5]
            }, 
         }, 
     },
     4:{//鞋子 8454

     },
     5:{//盾牌 8455 (原披风, 只能装备在单手武器时装备,需判断武器类型 )

     },
     6:{//饰品 类  8456

     },
     7:{//护符类   8457 (允许俩,占用,6,7位置)

     }
};  