


var gCfg={ 
    bb:0.4,
           
           
    sex:-1,  
   
    task:{ 
        
        jq:[ 
           [0,0,0],   
        ],
      
      
    },   
    log:{
         
    },
    wpXz:[0,-1], 
    yx:[
       
    ],
    
    opt:{
        tsDl:0, 
        rWrZ:0,
        rrp:0, 
        dhk:0, 
        tsk:0, 
        
        jnQh:[0,0,0,0,0],  
        zt:-1,  
        gn:0,   
        zzKg:0, 
        wpjh:0, 
        jsgx:0, 
        bagn:0, 
        bag:0,  
                
        szbt:-1,  
        szbn:-1,  
        szb:0,    
    },
    
    bag:{
       
        n:2, 
        0:[  
               
                
              
               
                 
                 {t:13,id:0,n:1},
                 {t:13,id:1,n:1},
                 {t:13,id:2,n:1},
                 {t:13,id:3,n:1},
             
         ],
         1:[
         
         ], 
    },
    
    wpCfg:{
        
        
            
           
            0:[0,1,1],
            1:[1,1,1],
            2:[2,1,1],
            3:[3,1,1],
            4:[4,1,1],

            5:[7,1,1],
            6:[8,1,1],
            11:[12,1,1],
            12:[11,1,0],
            13:[14,1,1], 
            
            
            14:[20,1,1],
            15:[21,1,1],
            16:[22,1,1],
            17:[23,1,1],
            18:[24,1,1],
            19:[25,1,1],

            
            20:[1,20,1],  
            21:[2,20,1],  
            22:[3,20,1],  
            23:[4,50,1],  
            24:[5,99,1],  
            25:[6,99,1],  
            26:[13,99,1], 
            27:[9,999,1],  
            28:[10,999,1],  
            29:[12,999,1],  
    },
    
    skill:{
        jn:[[8400,8],[8402,5],0,0,0,[8400,7]], 
        kj:[[8401,4],[8402,5],0,0,0,[8403,0]],
    },
    tp:{ 
        
        
        20:[ [0,180] ], 
        
        21:[],
        
        22:[],
        
        23:[],
        
        24:[],
        
        25:[],
    },
    zbXx:[], 
    
    zb:{ 
    
    },
    zbData:[200,200,0,0,0,0,0,0,0,0,0], 
    zbMb:[200,200,0,0,0,0,0,0,0,0,0],  
    zbXM:[200,200,200,200],
    zbSx:[[[0,0],0,0,0,0,200],] ,
};





var gTxt={
    
    
     0:{
        
          0:{
              0:[0,8450,0,'匕首','一把其貌不扬的的短匕! 虽说如此但却很危险 , 请小心使用!! '],     
              40:[0,8450,1,'木棍','法术学院幼儿班的训练道具 , 用来做初级师范演示 , 作为法术的施展媒介只比 烧火棍 强上一丢丢'],
              80:[0,8450,2,'斧子','虽然是石头做的 , 劈柴之类的还是不在话下'],
              120:[0,8450,3,'大棒','不知什么人做了这个怪东西! 即粗糙,又不知用在什么地方好!!!'],
          },
          1:{
              
          },
          2:{
          },
          3:{
          },
          4:{

          },
          5:{
             160:[0,8450,4,'木盾','明明就是个锅盖 , 可能是谁家小孩子顽皮做成了盾牌 , 虽然拿出去有点丢人 , 但总比被怪物咬在身上要好... ']
          },
          6:{

          },
     },
     1:{
         
         0:[20,8450,0,'测试代药品','仅测试',[0,400,400]],
     },
     2:{
         0:[2,8404,6,'萝卜豆芽汤','鲜....',[5,80,80]],
     },
     3:{

     },
     4:{
        80:[23,8461,0,'向日葵种子','种植可收获大量瓜子...||(土坷垃农业有限公司)'], 
        81:[23,8461,1,'玉米种子','种植可收获大量玉米...||(土坷垃农业有限公司)'],
        82:[23,8461,2,'草莓种子','种植可收获大量草莓...||(土坷垃农业有限公司)'],
        83:[23,8461,3,'豆角种子','种植可收获大量豆角...||(土坷垃农业有限公司)'],
        84:[23,8461,4,'番茄种子','种植可收获大量番茄...||(土坷垃农业有限公司)'],
        85:[23,8461,5,'胡萝卜种子','种植可收获大量胡萝卜...||(土坷垃农业有限公司)'],
        86:[23,8461,6,'辣椒种子','种植可收获大量辣椒...||(土坷垃农业有限公司)'],
        87:[23,8461,7,'南瓜种子','种植可收获大量南瓜...||(土坷垃农业有限公司)'],
        88:[23,8461,8,'茄子种子','种植可收获大量茄子...||(土坷垃农业有限公司)'],
        89:[23,8461,9,'土豆种子','种植可收获大量土豆...||(土坷垃农业有限公司)'],

     },
     5:{
        0:[24,8404,0,'新鲜的胡萝卜','富含丰富的维他命C'],
        1:[24,8404,3,'嫩豆芽','新鲜的绿豆芽'],
        80:[24,8460,0,'葵花子','嗑一颗,就停不下来...'],
        81:[24,8460,1,'玉米棒子','籽粒饱满的玉米棒子, 有很多用途...'],
        82:[24,8460,2,'草莓','酸甜可口,但不易储存...'],
        83:[24,8460,3,'豆角','籽粒饱满的豆荚...'],
        84:[24,8460,4,'番茄','又沙又甜,还带这点儿酸...'],
        85:[24,8460,5,'胡萝卜','富含维生素C...'],
        86:[24,8460,6,'辣椒','辣...'],
        87:[24,8460,7,'南瓜','除了吃,还想拿它做点什么...'],
        88:[24,8460,8,'茄子','果肉饱满...'],
        89:[24,8460,9,'土豆','怎么做都好吃...'],
     },
     6:{

     },
     7:{
        6060:[5,8462,0,'猪','耳大嘴巴长，一条小尾巴，光吃不干活，饱了就睡下.....']   
     },
     12:{
         0:[29,8463,0,'蛇毒','也许有人需要...'],
         1:[29,8463,1,'蛇皮','制作材料...'],

     },
     13:{
        
     },
     14:{
      
         0:[13,8470,0,'说明手册__装备,','     点击左上(衣服)装备图标打开,可以进行装备相关操作.先选中装备,再点击手指按钮,即可装备. 同理,可以使用摘除按钮,脱下已选中的装备物品....'],
         1:[13,8470,0,'说明手册__种植养殖','    点击屏下左侧(种养殖)功能,  (圆形切换)按钮为: 养殖 和 种植 功能的转换. 此时打开背包先选中 种子然后关闭, 即可通过按钮相关功能在农场或养殖场进行对应操作'],
         2:[13,8470,0,'说明手册__攻击交互','    点击屏下右侧(攻击交互)功能,  (圆形切换)按钮为: 攻击 和 交互 功能的转换. 通过 交互 功能面板打开的背包,可以使用或设置快捷物品. 交互(手指)按钮可与小镇居民沟通,以及触发使用场景特殊物品...'],
         3:[13,8470,0,'说明手册__储存进度,','     位于居住房间时,点击屏幕上侧(磁盘)按钮可存储, 当深夜时进行储存会直接过渡到第二日'],
       
       
       
     },   
     20:{
       
        0:[10 , [[5,0,8],[5,1,8] ] , [8,80,80,5],'萝卜豆芽汤','本地特产,美味可口',[21,0]],
     },
     21:{

     },
     22:{

     },
     23:{

     },
     24:{

     },
     25:{

     },
     
};

(function(){
    var o=gTxt,d,i=0,l,a,b,c,e,f,g,h,s,m,t;
        d=[
          
          
          [[251,254,0],[8451,1],['发型','村里人都说俺帅...']],  
          [[255,259,4],[8451,1],['发型','听说敢留板寸的人都有着俊毅的面庞 , 其实....|(这话谁说的!? 咋那么有道理呢!!!)']],
          [[321,325,9],[8451,1],['发型','这么可爱的我 , 怎能不留个俏皮的丸子头呢!']],
          [[326,331,14],[8451,1],['发型','虽说是贴牌的 , 但听说产自万花谷 , 就凭这点也一定能令我的魅力加分不少 ']],
          
          [[450,452,0],[8452,2],['薄毛衣','好像有点儿冷, 穿上它刚刚好...']],
          [[520,522,3],[8452,2],['薄毛衣','丝丝微风拂过, 竟有些许凉意 , 天凉了要注意保暖, 先试穿下好不好看...']],
          
          [[651,653,0],[8453,3],['裤衩','清凉的大裤衩子...']],
          [[654,656,3],[8453,3],['裤子','版型简洁的长裤 , 尺码刚好合适! 省去剪裁了....']],
          [[721,723,6],[8453,3],['裤衩','清爽的小裤裤, 居家穿格外舒适... ']],
          [[724,726,9],[8453,3],['裙子','这可爱的小裙裙! 仿佛又回到了18岁 |(等等!! 我本来几岁来着?)  ... ']],
       ];
       l=d.length;
       while(i<l){
          a=d[i];
          b=a[0];
          s=b[0],e=b[1]+1,c=b[2];  
          b=a[1];
          f=b[0],g=b[1]; 
          h=o[0][g];  
          b=a[2];
          m=b[0],t=b[1]; 
          while(s<e){
             h[s]=[0,f,c,m,t];
            s++,c++;
          }; 
         i++;
       };
})();


var gTsk={
        
        0:'播种失败! 需先选择种子 , 且只能在农田 未种植 的位置播种...',
        1:'未成熟......还不能收获!!!!',
        2:'种植需要先选中种子才可以, 不知道身上有没有!!!!',
        3:'并没有作物需我要这么做!!!',
        
        10:'我想放下什么! 可是手上空空如也...',
        11:'这里可不是放养动物的地方!!!',
        12:'我离的太远了,要在养殖场的设施面前才可以这么做...',
        13:'捕捉到一把空气...',  
        14:'动物们没有 水 喝了 !!!',
        15:'动物们没有 食物 了 !!!',
        16:'一只小动物因 (营养不良) 而饿死了 !!!',
        17:'一只小动物因 (活的太久) 而寿终正寝了 !!!',
        
        
        30:'新的一天开始了.....',
        31:'天黑了....',
        32:'好困! 好想钻进被窝....',
        33:'夜深了 , 阵阵疲倦袭来.....',
        34:'已 存档 .....',
        35:'开始录屏...', 
        36:'获得了xxx奖励!',
        37:'暂时还不能这么做!!!!',
        38:'未装备武器!!!!',
        39:'剧情进行时不能这么做!!!',
        40:'这扇门打不开! 因为屋里没人么!?',
        41:'背包全部满了!!装不下...',
        42:'你丢失了某些物品....',
        43:'世界发生了异变, 似乎整个 梦境"重组" 了,  一些东西变得和之前不一样了....',
        
        60:'获得了新物品 , 打开背包检查...'
};



var gNpcJb={ 
        100:{
           a:'提示',
           b:[[0]],
           c:{
             0:{
                t:1,
                s:'    在屏幕中间下方选择(种养殖)功能, 然后使用右侧(切换按钮)到(养殖模式);|   使用(抓捕按钮)的同时走到小猪位置尝试捕抓.',
                m:[[0]]
             }
           }
        },
        7020:{
            a:'村长',
            b:[
               [1],
               [1,[[-1,0]]],
               [1,[[-1,1]]],
               [1,[[-1,2]]],
               [0,[[-1,3]]],
            ], 
            c:{
               
               0:{
                  t:1,
                  s:'你来了!!',
                  z:{
                     0:{
                        t:0,
                        s:['?????认得我!!!!'],
                        z:{
                           0:{
                              t:1,
                              s:['当然,能够进入这个世界的除了偶然的"闯入者",只有"梦境主宰者"本身.'],
                              z:{
                                 0:{
                                    t:0,
                                    s:['"梦境"!!!!!!|"主宰者"!!!!!!!!'],
                                    z:{
                                       0:{
                                          t:1,
                                          s:['    咳咳___呃___简单说:你现在身处的是梦境,因你而生,却不受完全支配, 正如噩梦时的身不由己.'],
                                          z:{
                                             0:{
                                                t:0,
                                                s:['.......头脑风暴..........|.....震惊....兴奋...恐惧...#~@#$%^&**&^%$#@~....|那我该怎么回去?'],
                                                z:{
                                                   0:{
                                                      t:1,
                                                      s:['    梦境只有睡着的时候才能进入,所以现实中梦醒时,自然能够摆脱.|    当然入眠并不一定能够入梦 . "意识"参与梦境的深度 ,决定了你对梦境的感知度.所以很多时候,你可能明明来过,却不自知.'],
                                                      m:[[0]]
                                                   }
                                                }
                                             }
                                          }
                                       }
                                    }
                                 }
                              }
                           }
                        }
                     },
                     
                  }
               },
               
               1:{
                  t:0,
                  s:'    "闯入者"?',
                  z:{
                     0:{
                        t:1,
                        s:['    现实中,和你有共同的记忆的亲友,在进行相似背景的梦境时,会有几率产生梦境"谐振", 短暂出现在他人梦境中.|    大多是浮光掠影,匆匆而过, 并不会对梦境主体产生影响.'],
                        m:[[0]]
                     }
                  }
                },
                
                2:{
                   t:0,
                   s:'    那我现在应该做什么?',
                   z:{
                      0:{
                         t:1,
                         s:['    虽说是梦境,却也是现实世界的投影. 即遵照现实中的规则, 又不完全遵守现实. 刻意改变突破规则,只会造成梦境世界的崩溃,对现实中的大脑造成伤害.|    但! 就像噩梦时的身不由己, 纵有心亦无力, 何不当做活在另一个现实中的自己, 照常生活..'],
                         z:{
                            0:{
                               t:0,
                               s:['    吃饭、喝水、入厕、睡觉、上学,上班......|    全部?'],
                               z:{
                                 0:{
                                    t:1,
                                    s:['    差不多!也不尽然,可能更多!|    我想想.......|    既然如此! 我送你几头猪仔好了. 先从"养猪"学起, 在这个镇上生活首先要学会生产.'],
                                    m:[
                                       [2,0,6]
                                    ]
                                 }
                               }

                            }
                         }
                      }
                   }           
                },
                
                3:{
                    t:0,
                    s:'    猪被我抓完了!',
                    z:{
                       0:{
                          t:1,
                          s:['    还以为会很难!|    你住的农场养殖区里可以饲养这些小猪, 记得按时喂水填料 . 此外你可以向其他居民打听如何种植 , 多摸索就全部掌握了. '],
                          m:[[1,1,[[13,1,1]]]]
                       }
                    }
                },
                
                4:{
                   t:0,
                   s:'    镇子的东面.',
                   z:{
                      0:{
                         t:1,
                         s:['    哦!那里住着一个怪人,研究一些奇奇怪怪的东西,具体我也不清楚.'],
                         m:[[0]]
                      }
                   }
                },
            }
        },
        7220:{
             a:'大婶',
             b:[
                [0,[[-1,4] ]],  
                [1],            
                [1,[[-1,1] ]],  
                [1,[[-1,2] ]],  
                [1,[[-1,3] ]],  
             ], 
             c:{
                
                
                0:{
                   t:1,
                   s:'你好,希望能适应这里.', 
                   m:[
                      [0], 
                   ],
                },
                
                
                1:{
                    t:1, 
                    s:'天!!!|   难道又一个!',
                    m:[
                        [2,0,1],   
                    ],
                },
                
                2:{
                  t:1,
                  s:'果然!|   又一个"入梦者"! 村长说发现要妥善安置, 虽然不知为什么.|   但请跟我来吧, 正好有一处闲置的旧农场,希望你能喜欢 ',
                  z:{
                     0:{
                        t:0,  
                        s:[' .........|(头痛欲裂,脑海里像捅落的马蜂窝般嗡嗡作响, 想说些什么却组织不出片言只语!!! 脑子怕是要烧掉了)|..... '], 
                        
                        z:{
                          0:{
                            t:1,
                            s:['........|不说话那就是同意了!, 请跟我来吧'],
                            m:[
                              [2,0,2], 
                            ]
                          }
                        }
                     } 
                  }
                },
                
                3:{
                  t:1,
                  s:'就是这里了! 昨天刚打扫过.|   已经很晚了,暴雨马上要下下来的样子,我必须先走了|   明天不下雨的话可以到镇子里,我想村长一定有话对你说.',
                  m:[
                    [2,0,3],  
                  ]
                },
                
                4:{
                  t:0,
                  s:'.........|   (大婶说完就急匆匆走了..... 好困!脑袋有千斤重.......)',
                  m:[
                    [2,0,4],  
                  ] 
                },
             },
        },
        7021:{
            a:'护士',
            b:[
               [0]
            ],
            c:{
               0:{
                   t:1,
                   s:'虽然医院的工作的工作很清闲, 但还是要按时值班',
                   m:[[0]] 
               }
            }
        },
        7022:{
            a:'护士',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'你也有八卦么?',
                  z:{
                     0:{
                        t:0,
                        s:['呃!......'],
                        m:[[0]]
                     }
                  }
               }
            }
        },
        7023:{
            a:'护士',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'|   镇上的阿酷, 每日里四处徘徊, 期待有一天能被星探发掘, 要我说:这看起来很蠢!',
                  m:[[0]] 
               }
            }
        },
        7037:{
            a:'女医生',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'眼耳口鼻是相通的.....',
                  m:[[0]] 
               }
            }
         },
         7031:{ 
            a:'男医生',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'血压,体重,身高, 要测哪一个?',
                  z:{
                     0:{
                        t:0,
                        s:['不了,谢谢!!'],
                        m:[[0]] 
                     }
                  }
                 
               }
            }
         },
         7027:{
            a:'男医生',
            b:[
               [0],
            ],
            c:{
               0:{
                  t:1,
                  s:'为什么明明每个人都有脑子 , 可有些人的言行却不像长了脑子 ?',
                  z:{
                     0:{
                        t:0,
                        s:[
                           '▷......呃!!!!这......',
                           '▷我想是大概是因为  "无知" 吧!'
                        ],
                        z:{
                           0:{
                              t:1,
                              s:['咳咳(略显尴尬的微笑)|这么高深的问题,我都想不明白, 又怎么能为难一个外行'],
                              m:[[0]]
                           },
                           1:{
                              t:1,
                              s:['(震惊)......!!|我一直以为这是医学问题!|原来如此,原来如此(小声呢喃)...... '],
                              m:[[0]]
                           }
                        }
                    },
                  }
               }
            }
         },
         7024:{
            a:'男医生',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'医疗器械经常检查维护是对病人生命的尊重, 虽然这个科室自创建以来从未诊治过一个病人.',
                  m:[[0]] 
               }
            }
         },
         7026:{
            a:'男医生',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'正在思考,请勿打扰!',
                  m:[[0]] 
               }
            }
         },
         7030:{
            a:'男医生',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'    一些人的争论的仅仅是为了"输赢" , 而非"明理".|   所以!不要被那些标榜"高大上"的道理所唬弄, 道理是用来辅助"思考"的过程,而非"结果", 它既不"高大",更不"神圣". 但却可能复杂到你根本理解不了......',
                  m:[[0]] 
               }
            }
         },
         7033:{
            a:'琳',
            b:[ 
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'    你好,请随意...',
                  m:[[0]]
               }
            }
         },
         7034:{
            a:'冰冰',
            b:[ 
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'    如果有未知的"神秘书籍",可以同我交易,一定不会令你失望的.',
                  z:{
                     0:{
                        t:0,
                        s:['    神秘书籍????'],
                        z:{
                           0:{
                              t:1,
                              s:['    是的,这个世界散落着各种神秘传说.我也是恰巧搜集到其中的一本,才确定一些传说可能确有其实,虽然不见得最终可以集齐,但万一呢!'],
                              z:{
                                 0:{
                                    t:0,
                                    s:['    可我没有这样东西!'],
                                    z:{
                                       0:{
                                          t:1,
                                          s:['    哈哈!|    你有才稀奇呢!我这一本也是曾祖父留下来的,他是一名考古学专家,终其一生也就这样了, 到我这代就变成祖传传说了. 镇上很无聊,所以你有什么稀奇古怪的东西,一定要来找我呀!'],
                                          z:{
                                             0:{
                                                t:0,
                                                s:['    好...'],
                                                m:[[0]]
                                             }
                                          }
                                       }
                                    }
                                 }
                              }
                           }
                        }
                     }
                  }
               }
            }
         },
         7038:{
            a:'医生',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'我是一名心理医生 , 最近接待了很多 "PUA"创伤 咨询, 请问你的状况是?',
                  z:{
                     0:{
                        t:0,
                        s:[
                           '▷ 对不起! 走错门了!',
                           '▷ 什么是 PUA ?'
                        ],
                        m:[
                           [0],
                           -1,
                        ],
                        z:{
                           1:{
                              t:1,
                              s:['    PUA话术 的逻辑运用是以 否定对方 为基础 , 而非 建设性批评 (指出需要补足的短板).|   这种话术用于否定个人价值,打击摧毁他人自信心, 迫使对方从心理上臣服,接受不对等的条件. 常见运用场景如:情感,面试,上下属之间.....'],
                              z:{
                                 0:{
                                    t:0,
                                    s:['(背脊一阵凉意) 太恶毒 可怕了.......'],
                                    m:[[0]]
                                 }
                              }
                           }
                        }
                     }
                  }
               }
            }
        },
        7032:{
            a:'阿酷',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'(对方疑惑的看着我)|   我们认识么!??',
                  z:{
                     0:{
                        t:0,
                        s:['呃!不认识.....'],
                        m:[[0]]
                     }
                  }
               }
            }
        },
        7035:{
            a:'萌',
            b:[
               [0]
            ],
            c:{
               0:{
                  t:1,
                  s:'   你.......(仔细打量)|   是新来的吧?',
                  z:{
                     0:{
                        t:0,
                        s:['   嗯, 我住在西面的农场'],
                        z:{
                           0:{
                              t:1,
                              s:['阿冰生病了,最近我要一直值班, 等换班一定要抽空拜访下你'],
                              m:[[0]]
                           }
                        }
                     }
                  }
               }
            }
        },
        7036:{
           a:'老伯',
           b:[
              [1],        
              [0,[[-1,0]]], 
           ],
           c:{
              0:{
                 t:1,
                 s:'    种瓜得瓜,种豆得豆.  只要辛勤劳作, 土地就不会亏待你',
                 z:{
                    0:{
                       t:0,
                       s:['|这是!!!???(老伯顺手塞给我一堆东西)'],
                       m:[
                          [1,1,[[23,80,50],[23,81,50],[23,82,50],[23,83,50],[23,84,50],[23,85,50],[23,86,50],[23,87,50],[23,88,50],[23,89,50],[13,1]],0]
                       ]
                    }
                 }
              },
              1:{
                  t:0,
                  s:'|那个!!!您认错认人了吧?',
                  z:{
                     0:{
                        t:1,
                        s:['啥?'],
                        z:{
                           0:{
                              t:0,
                              s:['我说 , 您是不是认错人给错东西了?'],
                              z:{
                                 0:{
                                    t:1,
                                    s:['啥?我很忙,可没空陪你玩,请不要捉弄老人家'],
                                    m:[[0]]
                                 }
                              }
                           }
                        }
                     }
                  }
                  
              },
           }
        },
        7039:{
         a:'樵夫',
         b:[
            [1], 
            [0]
         ],
         c:{
            
            0:{
               t:1,
               s:'    你是要去西边的矿区么?',
               z:{
                  0:{
                     t:0,
                     s:['    不是!我初来这里还不熟悉,随意逛逛就走到这了..'],
                     z:{
                        0:{
                           t:1,
                           s:['    山里有野生危险动物出没,还是不要乱逛的好,尤其最近山里怪事频出,蛇突然就变多了!|    对了!今天砍柴捡了一把匕首,我留着没用,就送给你防身吧.'],
                           z:{
                              0:{
                                 t:0,
                                 s:['    (对方一片热情,虽然我也不大可能用到,但还是收下吧!)|    谢谢..'],
                                 m:[[1,1,[[0,0,1,1],[13,0,1],[13,2,1]],0]]
                              }
                           }
                        }
                     }
                  }   
               }
            },
            
            1:{
                t:0,
                s:'    关于西面?',
                z:{
                   0:{
                      t:1,
                      s:['    那里是旧矿区, 曾经被发现有金矿,导致小镇一度非常繁荣.但是开采没多久,就怪事频频,先是不知道哪里冒出来的毒蛇,接着又出现闹鬼事件,再加上挖出来的除了石头还是石头, 人就慢慢走光了,整个小镇就变成了现在萧条的样子'],
                      m:[[0]]
                   }
                },
            },
         }
        },
         
};

var gNpcF={
    0:function(){ 
      
      xnEvt.tsK(gTsk[60]);
    }
};




var gJqNr={
        a:[
            '第一章 初入梦境镇',
        ],
     
        
        0:[
           
           '　　脑海中一片浑沌，不知发生了什么！？好似一个梦，一切都不那么真实。',
           0, 
           
           '|　　我感到了极度的虚弱，倦怠的思绪像一团黏稠交织的浆糊。面对眼前这位和蔼大婶的问话，甚至组织不出一句完整的话语。不知如何以对，此刻我犹如森林中迷失又无助的小鹿，只能默默的接受这似若善意的指引，本能的遵循……',
           
           '|　　潮水般汹涌的困意!那就沉沉的睡去吧，就当是一场梦。人生如梦，谁又能肯定地告诉此刻的自己是真实的存在，还是一场梦境中自欺欺人的虚构故事。|    当！再度睁开双眸的时候，一切的一切一定都会翻篇……',
           1,
           
           '|　　……|　　当我再次打开惺忪的睡眼时，凝望着这陌生的天花板，陌生的床褥，陌生的墙壁、窗户、茶几……|　　这个地方的环境有着完全别样的气息，在我浑沌的识海中竟然找不出一丝可以与之匹配的线索。|　　仿佛！仿佛这里是另外一个世界，我真实的存在着……|　　但！不管怎样，我想我需要先熟悉这个奇怪的地方，也许应该先从熟悉大婶提到的小镇开始……',
           1,
           0,
           
           '    在自己的梦境中生活,这么不可思议的事情,真不知道该如何向身边的朋友说起!!!|    "脑波谐振"!?|    "梦境闯入者"!?|    一个比一个疯狂,说出去怕不会被当神经病,现实中也从未听说过同样的遭遇,所以还是低调点,免得被抓起来研究.|    当务之急,我还是先学会种养殖吧,就在我住的地方,希望一切都不太难,...',
           0,
        ],
        
}
//END  ************************************************************************************************************